unfdemo.BS_Billing/src/Catalogs/BS_СписокСервисов/BS_СписокСервисов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>BS_СписокСервисов</name>
  <tabularSections>
    <name>bs_kits</name>
    <attributes>
      <name>bs_id</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>bs_Вариант</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>bs_max</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>bs_min</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>1</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

unfdemo.BS_Billing/src/CommonModules/bs_ОбработкаРезультатаВызовСервера/Module.bsl
Процедура ОбработатьСервисы(Результат) Экспорт
	Для Каждого Элемент из Результат Цикл
	Если не ЗначениеЗаполнено(Справочники.BS_СписокСервисов.НайтиПоКоду(Элемент.id)) Тогда
	НовыйСервис = Справочники.BS_СписокСервисов.СоздатьЭлемент();
	НовыйСервис.Код = Элемент.id;
	НовыйСервис.Наименование = Элемент.name;
	Для Каждого kit из Элемент.kits цикл
		Новыйkit = НовыйСервис.bs_kits.Добавить();
		Новыйkit.bs_id = kit.id;
		Новыйkit.bs_Вариант = kit.name;
	КонецЦикла;
	НовыйСервис.Записать();
	КонецЕсли;
	КонецЦикла;
КонецПроцедуры
